tannerln7/Esp32Speakers/.pio/libdeps/Left/SigmaDSP/examples/3_Second_order_EQ/SigmaStudio_project/Export/3_Second_order_EQ_IC_1_REG.h
/* AnalogPowerDownRegister (IC 1) */
#define R19_DAC3_POWERDOWN_IC_1                   0x0    /* 0b	[0] */
#define R19_DAC2_POWERDOWN_IC_1                   0x0    /* 0b	[1] */
#define R19_DAC1_POWERDOWN_IC_1                   0x0    /* 0b	[2] */
#define R19_DAC0_POWERDOWN_IC_1                   0x0    /* 0b	[3] */
#define R19_DACS_RESET_IC_1                       0x0    /* 0b	[4] */
#define R19_REF_CORE_POWERDOWN_IC_1               0x0    /* 0b	[5] */
#define R19_REF_BUF_POWERDOWN_IC_1                0x0    /* 0b	[6] */
#define R19_ADCS_POWERDOWN_IC_1                   0x0    /* 0b	[7] */
#define R19_AUX_ADC_FILTER_IC_1                   0x0    /* 000b	[10:8] */
#define R19_DAC3_POWERDOWN_IC_1_MASK              0x1
#define R19_DAC3_POWERDOWN_IC_1_SHIFT             0
#define R19_DAC2_POWERDOWN_IC_1_MASK              0x2
#define R19_DAC2_POWERDOWN_IC_1_SHIFT             1
#define R19_DAC1_POWERDOWN_IC_1_MASK              0x4
#define R19_DAC1_POWERDOWN_IC_1_SHIFT             2
#define R19_DAC0_POWERDOWN_IC_1_MASK              0x8
#define R19_DAC0_POWERDOWN_IC_1_SHIFT             3
#define R19_DACS_RESET_IC_1_MASK                  0x10
#define R19_DACS_RESET_IC_1_SHIFT                 4
#define R19_REF_CORE_POWERDOWN_IC_1_MASK          0x20
#define R19_REF_CORE_POWERDOWN_IC_1_SHIFT         5
#define R19_REF_BUF_POWERDOWN_IC_1_MASK           0x40
#define R19_REF_BUF_POWERDOWN_IC_1_SHIFT          6
#define R19_ADCS_POWERDOWN_IC_1_MASK              0x80
#define R19_ADCS_POWERDOWN_IC_1_SHIFT             7
#define R19_AUX_ADC_FILTER_IC_1_MASK              0x700
#define R19_AUX_ADC_FILTER_IC_1_SHIFT             8

/* TestRegister (IC 1) */
#define R20_ADCCLOCKDELAY_IC_1                    0x0    /* 000b	[2:0] */
#define R20_ADCSYNCFILTL_SDATAA_D_IC_1            0x0    /* 0b	[3] */
#define R20_ADCSYNCFILTR_SDATAA_D_IC_1            0x0    /* 0b	[4] */
#define R20_SPIKEFILT_SEROUT0_1_IC_1              0x0    /* 0b	[5] */
#define R20_UNUSED_IC_1                           0x00   /* 0000000000b	[15:6] */
#define R20_ADCCLOCKDELAY_IC_1_MASK               0x7
#define R20_ADCCLOCKDELAY_IC_1_SHIFT              0
#define R20_ADCSYNCFILTL_SDATAA_D_IC_1_MASK       0x8
#define R20_ADCSYNCFILTL_SDATAA_D_IC_1_SHIFT      3
#define R20_ADCSYNCFILTR_SDATAA_D_IC_1_MASK       0x10
#define R20_ADCSYNCFILTR_SDATAA_D_IC_1_SHIFT      4
#define R20_SPIKEFILT_SEROUT0_1_IC_1_MASK         0x20
#define R20_SPIKEFILT_SEROUT0_1_IC_1_SHIFT        5
#define R20_UNUSED_IC_1_MASK                      0xFFC0
#define R20_UNUSED_IC_1_SHIFT                     6

/* AnalogInterfaceRegister0 (IC 1) */
#define R21_CHOP_ENB_INT_AMP_IC_1                 0x0    /* 0b	[0] */
#define R21_PD_INT_AMP_IC_1                       0x0    /* 0b	[1] */
#define R21_ADC_NON_OVERLAP_ADJ_IC_1              0x0    /* 0b	[2] */
#define R21_ADC_I_SEL_IC_1                        0x0    /* 00000b	[7:3] */
#define R21_ADC_CLK_ADJ_IC_1                      0x0    /* 000b	[10:8] */
#define R21_LCHOP_PMOS_CTRL_IC_1                  0x0    /* 00b	[12:11] */
#define R21_LCHOP_AMP_ENB_IC_1                    0x0    /* 0b	[13] */
#define R21_LSCRAM_ENB_IC_1                       0x0    /* 0b	[14] */
#define R21_AUX_ADC_EN_IC_1                       0x1    /* 1b	[15] */
#define R21_CHOP_ENB_INT_AMP_IC_1_MASK            0x1
#define R21_CHOP_ENB_INT_AMP_IC_1_SHIFT           0
#define R21_PD_INT_AMP_IC_1_MASK                  0x2
#define R21_PD_INT_AMP_IC_1_SHIFT                 1
#define R21_ADC_NON_OVERLAP_ADJ_IC_1_MASK         0x4
#define R21_ADC_NON_OVERLAP_ADJ_IC_1_SHIFT        2
#define R21_ADC_I_SEL_IC_1_MASK                   0xF8
#define R21_ADC_I_SEL_IC_1_SHIFT                  3
#define R21_ADC_CLK_ADJ_IC_1_MASK                 0x700
#define R21_ADC_CLK_ADJ_IC_1_SHIFT                8
#define R21_LCHOP_PMOS_CTRL_IC_1_MASK             0x1800
#define R21_LCHOP_PMOS_CTRL_IC_1_SHIFT            11
#define R21_LCHOP_AMP_ENB_IC_1_MASK               0x2000
#define R21_LCHOP_AMP_ENB_IC_1_SHIFT              13
#define R21_LSCRAM_ENB_IC_1_MASK                  0x4000
#define R21_LSCRAM_ENB_IC_1_SHIFT                 14
#define R21_AUX_ADC_EN_IC_1_MASK                  0x8000
#define R21_AUX_ADC_EN_IC_1_SHIFT                 15

/* AnalogInterfaceRegister1 (IC 1) */
#define R22_RSWC_DAC_CTRL_IC_1                    0x0    /* 00b	[1:0] */
#define R22_RCLK_SEL_PMOS_IC_1                    0x0    /* 00b	[3:2] */
#define R22_RCLK_SEL_AMP_IC_1                     0x0    /* 00b	[5:4] */
#define R22_RCHOP_PMOS_CTRL_IC_1                  0x0    /* 00b	[7:6] */
#define R22_LCLK_SEL_PMOS_IC_1                    0x0    /* 00b	[9:8] */
#define R22_LSWC_DAC_CTRL_IC_1                    0x0    /* 00b	[11:10] */
#define R22_CLK_SEL_INT_AMP_IC_1                  0x0    /* 00b	[13:12] */
#define R22_RSWC_DAC_CTRL_IC_1_MASK               0x3
#define R22_RSWC_DAC_CTRL_IC_1_SHIFT              0
#define R22_RCLK_SEL_PMOS_IC_1_MASK               0xC
#define R22_RCLK_SEL_PMOS_IC_1_SHIFT              2
#define R22_RCLK_SEL_AMP_IC_1_MASK                0x30
#define R22_RCLK_SEL_AMP_IC_1_SHIFT               4
#define R22_RCHOP_PMOS_CTRL_IC_1_MASK             0xC0
#define R22_RCHOP_PMOS_CTRL_IC_1_SHIFT            6
#define R22_LCLK_SEL_PMOS_IC_1_MASK               0x300
#define R22_LCLK_SEL_PMOS_IC_1_SHIFT              8
#define R22_LSWC_DAC_CTRL_IC_1_MASK               0xC00
#define R22_LSWC_DAC_CTRL_IC_1_SHIFT              10
#define R22_CLK_SEL_INT_AMP_IC_1_MASK             0x3000
#define R22_CLK_SEL_INT_AMP_IC_1_SHIFT            12

/* AnalogInterfaceRegister2 (IC 1) */
#define R23_UNUSED_IC_1                           0x0    /* 0b	[0] */
#define R23_ADC_DITHER_EN_IC_1                    0x0    /* 0b	[1] */
#define R23_XTAL_ENB_IC_1                         0x0    /* 0b	[2] */
#define R23_PLL_PD_IC_1                           0x0    /* 0b	[3] */
#define R23_IBIAS_TO_PIN_IC_1                     0x0    /* 0b	[4] */
#define R23_IBIAS_ADJ_IC_1                        0x0    /* 0000b	[8:5] */
#define R23_VREF_TRIM_IC_1                        0x0    /* 0000b	[12:9] */
#define R23_REF_I_SEL_IC_1                        0x0    /* 0b	[13] */
#define R23_RSCRAM_ENB_IC_1                       0x0    /* 0b	[14] */
#define R23_LCHOP_AMP_ENB_IC_1                    0x0    /* 0b	[15] */
#define R23_UNUSED_IC_1_MASK                      0x1
#define R23_UNUSED_IC_1_SHIFT                     0
#define R23_ADC_DITHER_EN_IC_1_MASK               0x2
#define R23_ADC_DITHER_EN_IC_1_SHIFT              1
#define R23_XTAL_ENB_IC_1_MASK                    0x4
#define R23_XTAL_ENB_IC_1_SHIFT                   2
#define R23_PLL_PD_IC_1_MASK                      0x8
#define R23_PLL_PD_IC_1_SHIFT                     3
#define R23_IBIAS_TO_PIN_IC_1_MASK                0x10
#define R23_IBIAS_TO_PIN_IC_1_SHIFT               4
#define R23_IBIAS_ADJ_IC_1_MASK                   0x1E0
#define R23_IBIAS_ADJ_IC_1_SHIFT                  5
#define R23_VREF_TRIM_IC_1_MASK                   0x1E00
#define R23_VREF_TRIM_IC_1_SHIFT                  9
#define R23_REF_I_SEL_IC_1_MASK                   0x2000
#define R23_REF_I_SEL_IC_1_SHIFT                  13
#define R23_RSCRAM_ENB_IC_1_MASK                  0x4000
#define R23_RSCRAM_ENB_IC_1_SHIFT                 14
#define R23_LCHOP_AMP_ENB_IC_1_MASK               0x8000
#define R23_LCHOP_AMP_ENB_IC_1_SHIFT              15

/* AnalogInterfaceRegister3 (IC 1) */
#define R24_DAC_OFFSET_IC_1                       0x1    /* 01b	[1:0] */
#define R24_DAC_DITHER_ENABLE_IC_1                0x0    /* 0b	[2] */
#define R24_PCTRL_IC_1                            0x0    /* 00b	[4:3] */
#define R24_DAC_PCLK_SEL_IC_1                     0x0    /* 00b	[6:5] */
#define R24_DAC_I_SEL_IC_1                        0x0    /* 0000b	[10:7] */
#define R24_DAC_CLK_SEL_IC_1                      0x0    /* 00b	[12:11] */
#define R24_DAC_CHOP_ENB_IC_1                     0x0    /* 0b	[13] */
#define R24_DAC_DRTZ_IC_1                         0x0    /* 00b	[15:14] */
#define R24_DAC_OFFSET_IC_1_MASK                  0x3
#define R24_DAC_OFFSET_IC_1_SHIFT                 0
#define R24_DAC_DITHER_ENABLE_IC_1_MASK           0x4
#define R24_DAC_DITHER_ENABLE_IC_1_SHIFT          2
#define R24_PCTRL_IC_1_MASK                       0x18
#define R24_PCTRL_IC_1_SHIFT                      3
#define R24_DAC_PCLK_SEL_IC_1_MASK                0x60
#define R24_DAC_PCLK_SEL_IC_1_SHIFT               5
#define R24_DAC_I_SEL_IC_1_MASK                   0x780
#define R24_DAC_I_SEL_IC_1_SHIFT                  7
#define R24_DAC_CLK_SEL_IC_1_MASK                 0x1800
#define R24_DAC_CLK_SEL_IC_1_SHIFT                11
#define R24_DAC_CHOP_ENB_IC_1_MASK                0x2000
#define R24_DAC_CHOP_ENB_IC_1_SHIFT               13
#define R24_DAC_DRTZ_IC_1_MASK                    0xC000
#define R24_DAC_DRTZ_IC_1_SHIFT                   14

#endif
